In [93]:
import numpy as np
import pandas as pd

Crearemos una serie de datos

In [94]:
d = {'a': 1, 'b': 2, 'c': 3,'d':4}
data=pd.Series(data=d)
print(data)

a    1
b    2
c    3
d    4
dtype: int64

Acceder a un elemento dado

In [95]:
data[-1]

4

In [96]:
data[::-1]

d    4
c    3
b    2
a    1
dtype: int64

In [97]:
data[1:3]

b    2
c    3
dtype: int64

En los dataframes podemos manipular los índices

In [98]:
data = pd.Series([2, 4, 6, 8],
                 index=['a', 'b', 'c', 'd'])
data

a    2
b    4
c    6
d    8
dtype: int64

In [99]:
data['b']

4

In [100]:
data['b':'d']

b    4
c    6
d    8
dtype: int64

Podemos crear un diccionario personalizado por ejemplo saquemos información de las principales ciudades de Coahuila

In [101]:
dicc_poblacion = {'Torreon': 720848,
                   'Monclova': 231107,
                   'Saltillo': 807537,
                   'Zaragoza': 12411,
                   'Arteaga': 6100}
poblacion = pd.Series(dicc_poblacion)
poblacion

Torreon     720848
Monclova    231107
Saltillo    807537
Zaragoza     12411
Arteaga       6100
dtype: int64

In [102]:
poblacion['Saltillo']

807537

In [103]:
poblacion['Saltillo']=807690

In [104]:
poblacion['Saltillo']

807690

In [105]:
poblacion['Monclova':'Zaragoza']

Monclova    231107
Saltillo    807690
Zaragoza     12411
dtype: int64

In [106]:
dicc_area= {'Torreon': 1500,
                   'Monclova': 1700,
                   'Saltillo': 3500,
                   'Zaragoza':2000,
                   'Arteaga': 900}

area=pd.Series(dicc_area)
print(area)

Torreon     1500
Monclova    1700
Saltillo    3500
Zaragoza    2000
Arteaga      900
dtype: int64

Ahora crearemos un DataFrame

In [107]:
ciudades_coah=pd.DataFrame({'Poblacion':poblacion, 'Area':area})
ciudades_coah

          Poblacion  Area
Torreon      720848  1500
Monclova     231107  1700
Saltillo     807690  3500
Zaragoza      12411  2000
Arteaga        6100   900

In [108]:
ciudades_coah.index

Index(['Torreon', 'Monclova', 'Saltillo', 'Zaragoza', 'Arteaga'], dtype='object')

In [109]:
ciudades_coah.columns

Index(['Poblacion', 'Area'], dtype='object')

In [110]:
ciudades_coah['Area']

Torreon     1500
Monclova    1700
Saltillo    3500
Zaragoza    2000
Arteaga      900
Name: Area, dtype: int64

Crearemos ahora una matriz de números aleatorios como un DataFrame de 5 filas con 4 columnas

In [111]:
miDF=pd.DataFrame(np.random.randint(0,20,size=(5,4)), columns= ['A','B','C','D'])
miDF

    A   B   C   D
0  12   4  16   6
1   5  13  15  12
2   6   6   2   1
3   8   9   1   4
4  13   6  17  16

Crearemos una nueva función que consista en la raíz cuadrada de cada uno de los elementos del dataset que acabamos de crear miDF

In [112]:
sqrDF=np.sqrt(miDF)
sqrDF

          A         B         C         D
0  3.464102  2.000000  4.000000  2.449490
1  2.236068  3.605551  3.872983  3.464102
2  2.449490  2.449490  1.414214  1.000000
3  2.828427  3.000000  1.000000  2.000000
4  3.605551  2.449490  4.123106  4.000000

Podemos además aplicar funciones compuestas a diferentes Datasets. Por ejemplo crearemos dos datasets con índices que no coincidan

In [118]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
print(A)
print(B)

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

Ahora apliquemos una función compuesta como hicimos con NumPY

In [119]:
addDS=A+B
addDS

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

Podemos indicar que en caso de no existir un valor por default realice la operación con determinado valor; por ejemplo con 0.

In [120]:
addDS=A.add(B,fill_value=0)
addDS

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

Una de las grandes ventajas de los Dataframes con respecto a las matrices con Numpy es el manejo de los índices. Vamos a crear dos datasets con columnas A,B y valores aleatorios de 5 filas y luego haremos un nuevo dataset con valores B,C,A con 5 filas

In [121]:
A=pd.DataFrame(np.random.randint(0,20,size=(5,2)),columns=['A','B'])
A

    A   B
0  12  13
1  17   2
2   9   4
3   2  15
4   7   2

In [122]:
B=pd.DataFrame(np.random.randint(0,20,size=(7,3)),columns=list('BCA'))
B

    B   C   A
0  10  13   5
1  13   5   5
2  15   1   7
3  16  17  16
4  13  14   5
5   7   5   3
6  13   8   2

Ahora hagamos la suma de estos elementos

In [123]:
A+B

      A     B   C
0  17.0  23.0 NaN
1  22.0  15.0 NaN
2  16.0  19.0 NaN
3  18.0  31.0 NaN
4  12.0  15.0 NaN
5   NaN   NaN NaN
6   NaN   NaN NaN

Como le hacemos para que no quede el valor en NaN

In [124]:
C=A.add(B,fill_value=0)
C

      A     B     C
0  17.0  23.0  13.0
1  22.0  15.0   5.0
2  16.0  19.0   1.0
3  18.0  31.0  17.0
4  12.0  15.0  14.0
5   3.0   7.0   5.0
6   2.0  13.0   8.0

Supongamos que tenemos un arreglo con índices no necesariamente establecidos en orden secuencial

In [125]:
datos = pd.Series(['a', 'b', 'c','d','e'], index=[1, 3, 5,2,8])
datos

1    a
3    b
5    c
2    d
8    e
dtype: object

In [127]:
datos[1]

'a'

La función iloc utiliza el indexado lógico (el que utiliza de forma implícita python)

In [129]:
datos.iloc[1]

'b'

La función loc utiliza el indexado explícito (el que utiliza de forma explícita el dataframe)

In [130]:
datos.loc[1]

'a'

Así por ejemplo la siguiente instrucción nos marcaría error con iloc; sin embargo, con loc es válida

In [131]:
datos.loc[8]

'e'

In [132]:
datos.iloc[8]

IndexError: single positional indexer is out-of-bounds

In [133]:
datos.loc[1:8]

1    a
3    b
5    c
2    d
8    e
dtype: object

In [134]:
datos.iloc[1:4]

3    b
5    c
2    d
dtype: object

Veamos como utilizar estas instrucciones con los dataframes

Veamos ahora un ejemplo real

In [136]:
area = pd.Series({'Torreon': 42396, 'Monclova': 69566,
                  'Saltillo': 14129, 'Zaragoza': 17031,
                  'Arteaga': 14999})
poblacion = pd.Series({'Torreon': 3833252, 'Monclova': 2644819,
                 'Saltillo': 1965112, 'Zaragoza': 1955286,
                 'Arteaga': 1288213})
data = pd.DataFrame({'area':area, 'poblacion':poblacion})
data

           area  poblacion
Torreon   42396    3833252
Monclova  69566    2644819
Saltillo  14129    1965112
Zaragoza  17031    1955286
Arteaga   14999    1288213

In [137]:
data['area']

Torreon     42396
Monclova    69566
Saltillo    14129
Zaragoza    17031
Arteaga     14999
Name: area, dtype: int64

In [138]:
data['poblacion']

Torreon     3833252
Monclova    2644819
Saltillo    1965112
Zaragoza    1955286
Arteaga     1288213
Name: poblacion, dtype: int64

In [139]:
data.area

Torreon     42396
Monclova    69566
Saltillo    14129
Zaragoza    17031
Arteaga     14999
Name: area, dtype: int64

In [140]:
data.poblacion

Torreon     3833252
Monclova    2644819
Saltillo    1965112
Zaragoza    1955286
Arteaga     1288213
Name: poblacion, dtype: int64

In [141]:
data['densidad']=data['poblacion']/data['area']
data

           area  poblacion    densidad
Torreon   42396    3833252   90.415417
Monclova  69566    2644819   38.018845
Saltillo  14129    1965112  139.083587
Zaragoza  17031    1955286  114.807469
Arteaga   14999    1288213   85.886592

In [142]:
data.values

array([[4.23960000e+04, 3.83325200e+06, 9.04154165e+01],
       [6.95660000e+04, 2.64481900e+06, 3.80188454e+01],
       [1.41290000e+04, 1.96511200e+06, 1.39083587e+02],
       [1.70310000e+04, 1.95528600e+06, 1.14807469e+02],
       [1.49990000e+04, 1.28821300e+06, 8.58865924e+01]])

In [143]:
np.min(data.values)

38.0188454129891

In [144]:
np.min(data.area)

14129

In [145]:
data

           area  poblacion    densidad
Torreon   42396    3833252   90.415417
Monclova  69566    2644819   38.018845
Saltillo  14129    1965112  139.083587
Zaragoza  17031    1955286  114.807469
Arteaga   14999    1288213   85.886592

In [146]:
data.iloc[:3,:2]

           area  poblacion
Torreon   42396    3833252
Monclova  69566    2644819
Saltillo  14129    1965112

In [147]:
data.loc[:'Zaragoza','poblacion':]

          poblacion    densidad
Torreon     3833252   90.415417
Monclova    2644819   38.018845
Saltillo    1965112  139.083587
Zaragoza    1955286  114.807469

In [148]:
data.loc[data.densidad<100]

           area  poblacion   densidad
Torreon   42396    3833252  90.415417
Monclova  69566    2644819  38.018845
Arteaga   14999    1288213  85.886592